# -----------------Задача-------------------- #
# вычислить периметр квадрата
# Что нужно чтобы вычислить периметр квадрата?
# ответ: сторона квадрата = a, представленное дробным или целым числом
# и  формула a*4 = дробное число
a = input("Введите сторону квадрата: ") # ввод данных с клавиатуры -> возвращает строку
a = int(a) # перевод в целое число
# функция вывода данных
print(a*4, type(a)) # type(a) - тип данных

# ----------тип данных (встроенные)------------ #
# число (int, float, complex)
# строка (str)
# логические (bool булевые)
# коллекции (list, tuple, set, dict)
